Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/component/nvm.h
/*
 * Component description for NVM
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-06-23T14:51:53Z */
#ifndef _WBZ35_NVM_COMPONENT_H_
#define _WBZ35_NVM_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR NVM                                          */
/* ************************************************************************** */

/* -------- NVM_NVMCON : (NVM Offset: 0x00) (R/W 32)  -------- */
#define NVM_NVMCON_RESETVALUE                 _UINT32_(0x00)                                       /*  (NVM_NVMCON)   Reset Value */

#define NVM_NVMCON_NVMOP_Pos                  _UINT32_(0)                                          /* (NVM_NVMCON)  Position */
#define NVM_NVMCON_NVMOP_Msk                  (_UINT32_(0xF) << NVM_NVMCON_NVMOP_Pos)              /* (NVM_NVMCON)  Mask */
#define NVM_NVMCON_NVMOP(value)               (NVM_NVMCON_NVMOP_Msk & (_UINT32_(value) << NVM_NVMCON_NVMOP_Pos)) /* Assigment of value for NVMOP in the NVM_NVMCON register */
#define NVM_NVMCON_LVDERR_Pos                 _UINT32_(12)                                         /* (NVM_NVMCON)  Position */
#define NVM_NVMCON_LVDERR_Msk                 (_UINT32_(0x1) << NVM_NVMCON_LVDERR_Pos)             /* (NVM_NVMCON)  Mask */
#define NVM_NVMCON_LVDERR(value)              (NVM_NVMCON_LVDERR_Msk & (_UINT32_(value) << NVM_NVMCON_LVDERR_Pos)) /* Assigment of value for LVDERR in the NVM_NVMCON register */
#define NVM_NVMCON_WRERR_Pos                  _UINT32_(13)                                         /* (NVM_NVMCON)  Position */
#define NVM_NVMCON_WRERR_Msk                  (_UINT32_(0x1) << NVM_NVMCON_WRERR_Pos)              /* (NVM_NVMCON)  Mask */
#define NVM_NVMCON_WRERR(value)               (NVM_NVMCON_WRERR_Msk & (_UINT32_(value) << NVM_NVMCON_WRERR_Pos)) /* Assigment of value for WRERR in the NVM_NVMCON register */
#define NVM_NVMCON_WREN_Pos                   _UINT32_(14)                                         /* (NVM_NVMCON)  Position */
#define NVM_NVMCON_WREN_Msk                   (_UINT32_(0x1) << NVM_NVMCON_WREN_Pos)               /* (NVM_NVMCON)  Mask */
#define NVM_NVMCON_WREN(value)                (NVM_NVMCON_WREN_Msk & (_UINT32_(value) << NVM_NVMCON_WREN_Pos)) /* Assigment of value for WREN in the NVM_NVMCON register */
#define NVM_NVMCON_WR_Pos                     _UINT32_(15)                                         /* (NVM_NVMCON)  Position */
#define NVM_NVMCON_WR_Msk                     (_UINT32_(0x1) << NVM_NVMCON_WR_Pos)                 /* (NVM_NVMCON)  Mask */
#define NVM_NVMCON_WR(value)                  (NVM_NVMCON_WR_Msk & (_UINT32_(value) << NVM_NVMCON_WR_Pos)) /* Assigment of value for WR in the NVM_NVMCON register */
#define NVM_NVMCON_Msk                        _UINT32_(0x0000F00F)                                 /* (NVM_NVMCON) Register Mask  */


/* -------- NVM_NVMCONCLR : (NVM Offset: 0x04) (R/W 32)  -------- */
#define NVM_NVMCONCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (NVM_NVMCONCLR)   Reset Value */

#define NVM_NVMCONCLR_Msk                     _UINT32_(0x00000000)                                 /* (NVM_NVMCONCLR) Register Mask  */


/* -------- NVM_NVMCONSET : (NVM Offset: 0x08) (R/W 32)  -------- */
#define NVM_NVMCONSET_RESETVALUE              _UINT32_(0x00)                                       /*  (NVM_NVMCONSET)   Reset Value */

#define NVM_NVMCONSET_Msk                     _UINT32_(0x00000000)                                 /* (NVM_NVMCONSET) Register Mask  */


/* -------- NVM_NVMCONINV : (NVM Offset: 0x0C) (R/W 32)  -------- */
#define NVM_NVMCONINV_RESETVALUE              _UINT32_(0x00)                                       /*  (NVM_NVMCONINV)   Reset Value */

#define NVM_NVMCONINV_Msk                     _UINT32_(0x00000000)                                 /* (NVM_NVMCONINV) Register Mask  */


/* -------- NVM_NVMCON2 : (NVM Offset: 0x10) (R/W 32)  -------- */
#define NVM_NVMCON2_RESETVALUE                _UINT32_(0x11F4000)                                  /*  (NVM_NVMCON2)   Reset Value */

#define NVM_NVMCON2_NVMPREPG_Pos              _UINT32_(0)                                          /* (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_NVMPREPG_Msk              (_UINT32_(0x1) << NVM_NVMCON2_NVMPREPG_Pos)          /* (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_NVMPREPG(value)           (NVM_NVMCON2_NVMPREPG_Msk & (_UINT32_(value) << NVM_NVMCON2_NVMPREPG_Pos)) /* Assigment of value for NVMPREPG in the NVM_NVMCON2 register */
#define NVM_NVMCON2_RETRY_Pos                 _UINT32_(8)                                          /* (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_RETRY_Msk                 (_UINT32_(0x3) << NVM_NVMCON2_RETRY_Pos)             /* (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_RETRY(value)              (NVM_NVMCON2_RETRY_Msk & (_UINT32_(value) << NVM_NVMCON2_RETRY_Pos)) /* Assigment of value for RETRY in the NVM_NVMCON2 register */
#define NVM_NVMCON2_VREAD1_Pos                _UINT32_(12)                                         /* (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_VREAD1_Msk                (_UINT32_(0x1) << NVM_NVMCON2_VREAD1_Pos)            /* (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_VREAD1(value)             (NVM_NVMCON2_VREAD1_Msk & (_UINT32_(value) << NVM_NVMCON2_VREAD1_Pos)) /* Assigment of value for VREAD1 in the NVM_NVMCON2 register */
#define NVM_NVMCON2_CREAD1_Pos                _UINT32_(13)                                         /* (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_CREAD1_Msk                (_UINT32_(0x1) << NVM_NVMCON2_CREAD1_Pos)            /* (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_CREAD1(value)             (NVM_NVMCON2_CREAD1_Msk & (_UINT32_(value) << NVM_NVMCON2_CREAD1_Pos)) /* Assigment of value for CREAD1 in the NVM_NVMCON2 register */
#define NVM_NVMCON2_TEMP_Pos                  _UINT32_(14)                                         /* (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_TEMP_Msk                  (_UINT32_(0x1) << NVM_NVMCON2_TEMP_Pos)              /* (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_TEMP(value)               (NVM_NVMCON2_TEMP_Msk & (_UINT32_(value) << NVM_NVMCON2_TEMP_Pos)) /* Assigment of value for TEMP in the NVM_NVMCON2 register */
#define NVM_NVMCON2_WS_Pos                    _UINT32_(16)                                         /* (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_WS_Msk                    (_UINT32_(0x1F) << NVM_NVMCON2_WS_Pos)               /* (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_WS(value)                 (NVM_NVMCON2_WS_Msk & (_UINT32_(value) << NVM_NVMCON2_WS_Pos)) /* Assigment of value for WS in the NVM_NVMCON2 register */
#define NVM_NVMCON2_SLEEP_Pos                 _UINT32_(24)                                         /* (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_SLEEP_Msk                 (_UINT32_(0x1) << NVM_NVMCON2_SLEEP_Pos)             /* (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_SLEEP(value)              (NVM_NVMCON2_SLEEP_Msk & (_UINT32_(value) << NVM_NVMCON2_SLEEP_Pos)) /* Assigment of value for SLEEP in the NVM_NVMCON2 register */
#define NVM_NVMCON2_ERS_Pos                   _UINT32_(28)                                         /* (NVM_NVMCON2)  Position */
#define NVM_NVMCON2_ERS_Msk                   (_UINT32_(0xF) << NVM_NVMCON2_ERS_Pos)               /* (NVM_NVMCON2)  Mask */
#define NVM_NVMCON2_ERS(value)                (NVM_NVMCON2_ERS_Msk & (_UINT32_(value) << NVM_NVMCON2_ERS_Pos)) /* Assigment of value for ERS in the NVM_NVMCON2 register */
#define NVM_NVMCON2_Msk                       _UINT32_(0xF11F7301)                                 /* (NVM_NVMCON2) Register Mask  */

